import random

def get_random_questions():
    easy = random.sample(easy_questions, 5)
    medium = random.sample(medium_questions, 5)
    hard = random.sample(hard_questions, 15)
    return easy + medium + hard



easy_questions = [
    {
        "text": "Кога е била втората световна война",
        "answers": ["1946-1967", "1927-1940", "1953-1978", "1939-1945"],
        "correct": 3,  # индекс на правилния отговор
        "reward": 10   # биткойни
    },
    {
        "text": "Кой е столицата на Франция?",
        "answers": ["Лондон", "Берлин", "Париж", "Рим"],
        "correct": 2,
        "reward": 10
    },
    {
        "text": "Коя държава е в азия",
        "answers": ["България", "Германия", "Микронезия", "Туркменистан"],
        "correct": 3,
        "reward": 10
    },
    {
        "text": "Кой предмерт се използва за смятане?",
        "answers": ["кутия", "калкулатор", "чаша", "Кубче на Рубик"],
        "correct": 1,
        "reward": 10
    },
    {
        "text": "Каква е известна фраза от междузвездни войни?",
        "answers": ["Хайде да нападаме!", "Запомни ме!", "Нека силата бъде с теб!", "Ще ги победим!"],
        "correct": 2,
        "reward": 10
    },
    {
        "text": "Как се казва Президентът на Франция",
        "answers": ["Емануел Макрон", "Наполеон Бонарпе", "Франк Хрйошен", "Луис Шехен"],
        "correct": 0,
        "reward": 10
    }
    {
        "text": "Каква е формулата на водата?",
        "answers": ["CO2", "NaCl", "H2O", "O2"],
        "correct": 2,
        "reward": 20
    },
    {
        "text": "Кое е по-тежко – 1 кг желязо или 1 кг памук?",
        "answers": ["Желязото", "Памукът", "И двете са равни", "Не се знае"],
        "correct": 2,
        "reward": 20
    },


]
medium_questions = [
    {
        "text": "Кой е основал Bitcoin?",
        "answers": ["Илон Мъск", "Сатоши Накамото", "Виталик Бутерин", "Бил Гейтс"],
        "correct": 1,
        "reward": 15
    },
    {
    "text": "Кой е бил дясната ръка на хитлер?",
    "answers": ["Руделф хес", "Сталин", "Херман Гъоринг", "Доктор Менгеле"],
    "correct": 2,
    "reward": 15
    },
    
    {
    "text": "Кой римски император е бил гладиатор по време на управлението си?",
    "answers": ["Комод", "Цезър", "Октавиус", "Неро"],
    "correct": 0,
    "reward": 15
    },

    {
    "text": "Кой е най-големият орган в човешкото тяло?",
    "answers": ["Сърцето", "белите дробове", "мозъкът", "кожата"],
    "correct": 3,
    "reward": 15
    },
    {  
    "text": "Кой президент на САЩ спечели Нобелова награда за мир?",
    "answers": ["Джордж Буш", "Барак Обама", "Бил Клинтън", "Роналд Рейгън"],
    "correct": 1,
    "reward": 15
    },

]
hard_questions = [
    {
        "text": "Кой елемент има най-висока електроотрицателност в Периодичната система?",
        "answers": ["Флуор", "Кислород", "Вода", "Аргон"],
        "correct": 0,
        "reward": 20
    },
    {
        "text": "Кое е най-малкото просто число, което е и фактор на 2024?",
        "answers": ["Протон", "Фотон", "Глуон", "Хигс Босон"],
        "correct": 2,
        "reward": 20
    },
    
    {
        "text": "Коя е най-голямата пустиня в света?",
        "answers": ["Сахара", "Антрактида", "Гоби", "Калахари"],
        "correct": 1,
        "reward": 20
    },

    {
        "text": "Кой е най-големият орган в човешкото тяло?",
        "answers": ["Сърцето", "белите дробове", "мозъкът", "кожата"],
        "correct": 3,
        "reward": 20
    },
    {  
        "text": "Кой президент на САЩ спечели Нобелова награда за мир?",
        "answers": ["Джордж Буш", "Барак Обама", "Бил Клинтън", "Роналд Рейгън"],
        "correct": 1,
        "reward": 20
    },

]