easy_questions = [
    {
        "text": "Кога е била втората световна война",
        "answers": ["1946-1967", "1927-1940", "1953-1978", "1939-1945"],
        "correct": 3,  # индекс на правилния отговор
        "reward": 10   # биткойни
    },
    {
        "text": "Кой е столицата на Франция?",
        "answers": ["Лондон", "Берлин", "Париж", "Рим"],
        "correct": 2,
        "reward": 10
    },
    {
        "text": "Коя държава е в азия",
        "answers": ["България", "Германия", "Микронезия", "Туркменистан"],
        "correct": 3,
        "reward": 10
    },
    {
        "text": "Кой предмерт се използва за смятане?",
        "answers": ["кутия", "калкулатор", "чаша", "Кубче на Рубик"],
        "correct": 1,
        "reward": 10
    },
    {
        "text": "Каква е известна фраза от междузвездни войни?",
        "answers": ["Хайде да нападаме!", "Запомни ме!", "Нека силата бъде с теб!", "Ще ги победим!"],
        "correct": 2,
        "reward": 10
    },
    {
        "text": "Как се казва Президентът на Франция",
        "answers": ["Емануел Макрон", "Наполеон Бонарпе", "Франк Хрйошен", "Луис Шехен"],
        "correct": 0,
        "reward": 10
    }

]
hard_questions = [
    {
        "text": "Кой е столицата на Франция?",
        "answers": ["Лондон", "Берлин", "Париж", "Рим"],
        "correct": 2,
        "reward": 20
    }


]